dress-watch/app/controllers/articles_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."comment_id" = $1  [["comment_id", 25]]
SELECT  DISTINCT "comments"."id" FROM "comments" LEFT OUTER JOIN "replies" ON "replies"."comment_id" = "comments"."id" WHERE "comments"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 25]]
---
  def show
    @full_article_data = {
      article: @article,
      comments: @article.comments.map { | comment | {
        comment: comment,
        replies: Comment.includes(:replies).where(:id => comment.id)[0].replies}

INSERT INTO "articles" ("title", "sub_title", "body", "user_id", "product_id", "published_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @article = current_user.articles.new(article_params)
    @article[:published_at] = Time.now

    # statment should short circuit and the article won't be saved
    if (current_user[:role]== "admin" || current_user[:role] == "editor") && @article.save

UPDATE "articles" SET "title" = $1, "sub_title" = $2, "body" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "test update by userD title 1"], ["sub_title", "sub title 1"], ["body", "updated by userD body 1"], ["updated_at", "2019-01-06 22:25:55.110340"], ["id", 1]]
---
  def update
    # statment should short circuit and the article won't be update
    if (current_user[:role]== "admin" || current_user[:role] == "editor") && @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def destroy
    # statment should short circuit and the article won't be destroy
    if (current_user[:role]== "admin" || current_user[:role] == "editor") && @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 7]]
---
    def set_article
      @article = Article.includes(:comments).find(params[:id])