dress-watch/app/controllers/brands_controller.rb

  def index
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

    def set_brand
      @brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]