dress-watch/app/controllers/replies_controller.rb

  def index
    @replies = Reply.all
---
SELECT "replies".* FROM "replies"

  def create
    @reply = Reply.new(reply_params)

    if @reply.save
---
INSERT INTO "replies" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test title 1"], ["body", "body 1"], ["created_at", "2019-01-07 09:58:54.239684"], ["updated_at", "2019-01-07 09:58:54.239684"]]

    def set_reply
      @reply = Reply.find(params[:id])
---
SELECT  "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]