dress-watch/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "user_name", "real_first_name", "real_last_name", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "user_name" = $1, "real_first_name" = $2, "real_last_name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["user_name", "userAA"], ["real_first_name", "AAAA"], ["real_last_name", "AAAA"], ["updated_at", "2019-01-10 17:51:37.281670"], ["id", 1]]
---
  def update
    if @user.update(user_params)